{
  "tracks": [
    "Data Science",
    "Web Development",
    "Speaker's Choice"
  ],
  "talks": [
    {
      "title": "Detecting Asteroids with Neural Networks",
      "description": "TensorFlow is an open-source software library for Machine Intelligence. In this talk, we will learn how to use it to build and train a neural network with the goal of correctly identifying asteroids in astrophotography data. The dataset used will be from the Sloan Digital Sky Survey, one of the most ambitious and influential surveys in the history of astronomy.\n\nUsing this data, we will learn how to create and featurize a training dataset, build and fit a neural network, and train our model to correctly identify asteroids visible from Earth.\n\nThis talk is for a wide range of Python developers, from those who have heard of machine learning, but have never experimented with it, to those who have significant experience with neural networks, but have never used TensorFlow before.\n\nThe audience should have some basic Python knowledge, but no formal or informal experience with machine intelligence is assumed.\n\nAfter watching this talk, the audience should know how to determine and develop features, how and why to build a training dataset, how to build and train a neural network, and some other approaches to supervised learning.",
      "time": "11:00am",
      "location": "Room A",
      "track": "Data Science",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/dustin.png",
        "name": "Dustin Ingram",
        "title": "Software Engineer",
        "companyName": "PromptWorks",
        "links": [
          {
            "type": "Github",
            "url": "https://github.com/di"
          }
        ]
      }
    },
    {
      "title": "Swiss Train Deployments",
      "description": "A Swiss Train deployment is a general-purpose deployment philosophy based on ideas from the Ember.js development process, modern browser releases, and various open-source project releases, such as the Ubuntu project.\n\nIn this talk, we’ll explore the motivation for a Swiss Train style deployment, the problems which it seeks to solve in existing deployment philosophies, and the core philosophy of a Swiss Train deployment.\n\nThis talk is for developers who are responsible for deploying code (not just Python!) to production in a timely manner, while still providing a stable ecosystem for their users.\n\nThe only background knowledge required is some amount of experience “deploying” code or releasing applications, whatever that may mean for an individual developer (essentially, this will allow the audience member to better empathize with the inefficiencies of current deployment philosophies (or lack thereof) and highlight the advantage of the proposed philosophy.\n\nAfter watching this talk, the audience should be able to: – understand why it is important to have a deployment philosophy – see the inefficiencies in current deployment philosophies – present a strong argument for adopting Swiss Train style deployments – be able to implement the deployment philosophy in their own workflow.",
      "time": "12:00pm",
      "location": "Room B",
      "track": "Data Science",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/dustin.png",
        "name": "Dustin Ingram",
        "title": "Software Engineer",
        "companyName": "PromptWorks",
        "links": [
          {
            "type": "Github",
            "url": "https://github.com/di"
          }
        ]
      }
    },
    {
      "title": "How to quickly build feature-rich interactive command-line applications with cmd2",
      "description": "cmd2 is a tool for building interactive command line applications in Python. Its goal is to make it quick and easy for developers to build feature-rich and user-friendly interactive command line applications. It provides a simple API which is an extension of Python’s built-in cmd module. cmd2 provides a wealth of features on top of cmd to make your life easier and eliminates much of the boilerplate code which would be necessary when using cmd.",
      "time": "2:00pm",
      "location": "Room C",
      "track": "Data Science",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/TODD-circle.png",
        "name": "Todd Leonhardt",
        "bio": "I am a professional software developer with 15 years experience developing embedded, desktop, and mobile applications in Python, C++, C, and Java.",
        "title": "Senior Cyber Engineer II",
        "companyName": "Raytheon",
        "companyLogo": "http://flpy.org/img/raytheon.jpeg",
        "links": [
          {
            "type": "Github",
            "url": "https://github.com/tleonhardt"
          }
        ]
      }
    }
  ],
  "agenda": [
    {
      "title": "Check in & breakfast",
      "time": "8:00am",
      "location": "Canvs Kitchen"
    },
    {
      "title": "Keynote",
      "time": "9:00am",
      "location": "Location TBD"
    },
    {
      "title": "Talks Begin",
      "time": "10:00am",
      "location": ""
    },
    {
      "title": "Lunch",
      "time": "12:00pm",
      "location": "Location TBD"
    },
    {
      "title": "Talks Resume",
      "time": "1:30pm",
      "location": ""
    },
    {
      "title": "Break",
      "time": "3:00pm",
      "location": ""
    },
    {
      "title": "Talks Resume",
      "time": "3:15pm",
      "location": ""
    },
    {
      "title": "Final Remarks",
      "time": "4:45pm",
      "location": "Location TBD"
    },
    {
      "title": "Bar Slither",
      "time": "5:00pm",
      "location": "Location TBD"
    }
  ]
}
