{
  "tracks": [
    "Data", //PowerDMS
    "Web", //Canvs
    "Speaker's Choice" //The Iron Yard
  ],
  "talks": [
    {
      "id": "postgres",
      "track": "Data",
      "title": "Postgres at any scale",
      "description": "Keeping your app performant is table stakes these days, but it doesn’t have to be rocket science. We’ll look at the basics for small, medium, and even terabytes of data for what you need to do to keep things performing well. We’ll start with the basics you need to know as an app developer about interacting with your database, then dig into how you can start to analyze performance. We’ll look at things you need to know for a small application, then the things you should be cautious of as you start to layer in other items you need to be aware of for performance including: Cache hit ratio, Index hit ratio, Proper use of indexes, Bloat, Efficient joins, Sharding",
      "time": "10:00 - 10:50am",
      "location": "PowerDMS",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/craig-circle.png",
        "name": "Craig Kerstiens",
        "title": "Head of Cloud",
        "companyName": "Citus Data",
        "links": [
          {
            "type": "twitter",
            "url": "https://www.twitter.com/craigkerstiens"
          },
          {
            "type": "website",
            "url": "http://www.craigkerstiens.com/"
          }
        ]
      }
    },
    {
      "id": "garbage_collection",
      "track": "Data",
      "title": "Using Python *for* Garbage Collection",
      "description": "One of the major things that my wife and I have looked for wherever we move is natural beauty and a good collection of public green space. So, when I walked by a park and creek reserve on the north end of our city, only to find more trash than green space, I was mortified. Working together with several individuals from Reddit we got the park to a reasonably clean state, removing over 400 gallons of trash. The experience made me realize, however, with over 480 parks, that as our city grew we needed a more self-sustaining solution to this problem. /nAfter sharing the story on Reddit, one thing that struck me was how many people were eager and capable of physically helping with the problem but had insufficient supplies or funds, and how many people couldn’t physically help, but were eager to throw money at the problem. I’m not political, and I certainly don’t have the time or ability to clean up 480+ parks, but like many of you, I know how to throw some code together. So I decided to build a tool that would connect those individuals with the funds to help to those with the time and physical ability. This talk is about how I created that tool, which consists of REST API, Website, and Android/IOS application using only Python and Open Source technologies. Finally, it is about how all of us as programmers have the power to make a visibly positive impact in our community even from the comfort and familiarity of our keyboards.",
      "time": "11:00 - 11:50am",
      "location": "PowerDMS",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/timothy-circle.png",
        "name": "Timothy Crosley",
        "title": "Open Source Evangelist",
        "companyName": "",
        "links": [
          {
            "type": "github",
            "url": "https://github.com/timothycrosley"
          }
        ]
      }
    }
  ],
  "agenda": [
    {
      "title": "Check in & breakfast",
      "time": "8:00am",
      "location": "Canvs Kitchen"
    },
    {
      "title": "Keynote",
      "time": "9:00am",
      "location": "Location TBD"
    },
    {
      "title": "Talks Begin",
      "time": "10:00am",
      "location": ""
    },
    {
      "title": "Lunch",
      "time": "12:00pm",
      "location": "Location TBD"
    },
    {
      "title": "Talks Resume",
      "time": "1:30pm",
      "location": ""
    },
    {
      "title": "Break",
      "time": "3:00pm",
      "location": ""
    },
    {
      "title": "Talks Resume",
      "time": "3:15pm",
      "location": ""
    },
    {
      "title": "Final Remarks",
      "time": "4:45pm",
      "location": "Location TBD"
    },
    {
      "title": "Bar Slither",
      "time": "5:00pm",
      "location": "Location TBD"
    }
  ]
}
