{
  "tracks": [
    "Data",
    "Web",
    "Speaker's Choice"
  ],
  "talks": [
    {
      "id": "postgres",
      "title": "Postgres at any scale",
      "description": "Keeping your app performant is table stakes these days, but it doesn’t have to be rocket science. We’ll look at the basics for small, medium, and even terabytes of data for what you need to do to keep things performing well. We’ll start with the basics you need to know as an app developer about interacting with your database, then dig into how you can start to analyze performance. We’ll look at things you need to know for a small application, then the things you should be cautious of as you start to layer in other items you need to be aware of for performance including: Cache hit ratio, Index hit ratio, Proper use of indexes, Bloat, Efficient joins, Sharding",
      "time": "10:00am - 10:50am",
      "location": "Canvs",
      "track": "Web",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/craig-circle.png",
        "name": "Craig Kerstiens",
        "title": "Head of Cloud",
        "companyName": "Citus Data",
        "links": [
          {
            "type": "twitter",
            "url": "https://www.twitter.com/craigkerstiens"
          },
          {
            "type": "website",
            "url": "http://www.craigkerstiens.com/"
          }
        ]
      }
    },
    {
      "id": "asteroids",
      "title": "Detecting Asteroids with Neural Networks",
      "description": "TensorFlow is an open-source software library for Machine Intelligence. In this talk, we will learn how to use it to build and train a neural network with the goal of correctly identifying asteroids in astrophotography data. The dataset used will be from the Sloan Digital Sky Survey, one of the most ambitious and influential surveys in the history of astronomy.\n\nUsing this data, we will learn how to create and featurize a training dataset, build and fit a neural network, and train our model to correctly identify asteroids visible from Earth.\n\nThis talk is for a wide range of Python developers, from those who have heard of machine learning, but have never experimented with it, to those who have significant experience with neural networks, but have never used TensorFlow before.\n\nThe audience should have some basic Python knowledge, but no formal or informal experience with machine intelligence is assumed.\n\nAfter watching this talk, the audience should know how to determine and develop features, how and why to build a training dataset, how to build and train a neural network, and some other approaches to supervised learning.",
      "time": "10:00am - 10:50am",
      "location": "PowerDMS",
      "track": "Data",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/dustin.png",
        "name": "Dustin Ingram",
        "title": "Software Engineer",
        "companyName": "PromptWorks",
        "links": [
          {
            "type": "Github",
            "url": "https://github.com/di"
          }
        ]
      }
    },
    {
      "id": "code_reviews",
      "title": "Code Reviews Using Art Critique Principles",
      "description": "Code reviews don’t have to be a time consuming, morale zapping, arduous tasks. Not only can they catch bugs and errors but they can contribute in positive ways to the individual developer, the team, management and company as a whole.\n\n Art critiques have existed in academia for hundreds of years. The methodology of the critique has evolved to be time sensitive and productive, while keeping the enthusiasm of the student artist intact.\n\n The purpose of the art critique is to get peers and mentors to look at the work and raise any problems they may see. It’s also time where people with more experience could contribute their knowledge in a helpful way. This process is about producing the best work, quickly and in a productive and constructive way.\n\n These methods can be applied to code review.\n\n PyCon attendees will come away from this talk with a set of methods that will enable them to preform constructive code reviews using art critique principles.",
      "time": "10:00am - 10:50am",
      "location": "The Iron Yard",
      "track": "Speaker's Choice",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/stacy-circle.png",
        "name": "Stacy Morse",
        "title": "Python Programmer",
        "companyName": "Freelancer",
        "links": [
          {
            "type": "Twitter",
            "url": "https://twitter.com/geekgirlbeta"
          },
          {
            "type": "Github",
            "url": "https://github.com/geekgirlbeta"
          },
          {
            "type": "Web",
            "url": "https://www.geekgirlbeta.com/"
          }
        ]
      }
    },
    {
      "id": "garbage_collection",
      "title": "Using Python *for* Garbage Collection",
      "description": "One of the major things that my wife and I have looked for wherever we move is natural beauty and a good collection of public green space. So, when I walked by a park and creek reserve on the north end of our city, only to find more trash than green space, I was mortified. Working together with several individuals from Reddit we got the park to a reasonably clean state, removing over 400 gallons of trash. The experience made me realize, however, with over 480 parks, that as our city grew we needed a more self-sustaining solution to this problem.\n\nAfter sharing the story on Reddit, one thing that struck me was how many people were eager and capable of physically helping with the problem but had insufficient supplies or funds, and how many people couldn’t physically help, but were eager to throw money at the problem. I’m not political, and I certainly don’t have the time or ability to clean up 480+ parks, but like many of you, I know how to throw some code together. So I decided to build a tool that would connect those individuals with the funds to help to those with the time and physical ability. This talk is about how I created that tool, which consists of REST API, Website, and Android/IOS application using only Python and Open Source technologies. Finally, it is about how all of us as programmers have the power to make a visibly positive impact in our community even from the comfort and familiarity of our keyboards.",
      "time": "11:00am - 11:50am",
      "location": "Canvs",
      "track": "Web",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/timothy-circle.png",
        "name": "Timothy Crosley",
        "title": "Open Source Evangelist",
        "companyName": "",
        "links": [
          {
            "type": "Github",
            "url": "https://github.com/timothycrosley"
          }
        ]
      }
    },
    {
      "id": "cm2",
      "title": "How to quickly build feature-rich interactive command-line applications with cmd2",
      "description": "cmd2 is a tool for building interactive command line applications in Python. Its goal is to make it quick and easy for developers to build feature-rich and user-friendly interactive command line applications. It provides a simple API which is an extension of Python’s built-in cmd module. cmd2 provides a wealth of features on top of cmd to make your life easier and eliminates much of the boilerplate code which would be necessary when using cmd.",
      "time": "11:00am - 11:50am",
      "location": "The Iron Yard",
      "track": "Speaker's Choice",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/TODD-circle.png",
        "name": "Todd Leonhardt",
        "bio": "I am a professional software developer with 15 years experience developing embedded, desktop, and mobile applications in Python, C++, C, and Java.",
        "title": "Senior Cyber Engineer II",
        "companyName": "Raytheon",
        "companyLogo": "http://flpy.org/img/raytheon.jpeg",
        "links": [
          {
            "type": "Github",
            "url": "https://github.com/tleonhardt"
          }
        ]
      }
    },
    {
      "id": "swiss_train",
      "title": "Swiss Train Deployments",
      "description": "A Swiss Train deployment is a general-purpose deployment philosophy based on ideas from the Ember.js development process, modern browser releases, and various open-source project releases, such as the Ubuntu project.\n\nIn this talk, we’ll explore the motivation for a Swiss Train style deployment, the problems which it seeks to solve in existing deployment philosophies, and the core philosophy of a Swiss Train deployment.\n\nThis talk is for developers who are responsible for deploying code (not just Python!) to production in a timely manner, while still providing a stable ecosystem for their users.\n\nThe only background knowledge required is some amount of experience “deploying” code or releasing applications, whatever that may mean for an individual developer (essentially, this will allow the audience member to better empathize with the inefficiencies of current deployment philosophies (or lack thereof) and highlight the advantage of the proposed philosophy.\n\nAfter watching this talk, the audience should be able to: – understand why it is important to have a deployment philosophy – see the inefficiencies in current deployment philosophies – present a strong argument for adopting Swiss Train style deployments – be able to implement the deployment philosophy in their own workflow.",
      "time": "1:20pm - 2:10pm",
      "location": "Canvs",
      "track": "Web",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/dustin.png",
        "name": "Dustin Ingram",
        "title": "Software Engineer",
        "companyName": "PromptWorks",
        "links": [
          {
            "type": "Github",
            "url": "https://github.com/di"
          }
        ]
      }
    },
    {
      "id": "feminism",
      "title": "Feminism & Functional Programming: When Paradigms Shift",
      "description": "Today, developers play a bigger role than ever in shaping culture. Often, those who don’t identify with the people who create a culture, don’t have power within that culture. This is why diversity in tech is so important. I’ll talk about controversial topics like feminism & functional programming…",
      "time": "1:20pm - 2:10pm",
      "location": "The Iron Yard",
      "track": "Speaker's Choice",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/cassie-circel.png",
        "name": "Cassandra R Wilcox",
        "title": "CEO",
        "companyName": "Code Hangar",
        "links": [
          {
            "type": "Twitter",
            "url": "https://twitter.com/CassandraWilcox"
          },
          {
            "type": "Github",
            "url": "https://github.com/csndra0504"
          }
        ]
      }
    },
    {
      "id": "one_for_all",
      "title": "Not For One But For All",
      "description": "Python is a booming language in the United States and finds itself integrated in practically every discipline involving software engineering. When new resources come out for us to develop better or faster we tend to forget that we build products for people who aren’t like us or who aren’t in situations like us. This is especially true of the web. In this talk, we will discuss how to increase our web apps accessibility through handy techniques and tools and how you can make use of the features of web frameworks like Flask or Django to make anyone coming to our spot on the Internet a bit more pleasant for everyone without it costing much more time.",
      "time": "2:20pm- 3:10pm",
      "location": "Canvs",
      "track": "Web",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/maxcell-circle.png",
        "name": "Maxcell Wilson",
        "title": "Developer Evangelist",
        "companyName": "",
        "links": [
          {
            "type": "Twitter",
            "url": "https://twitter.com/maxcell"
          },
          {
            "type": "Linkedin",
            "url": "https://linkedin.com/in/maxcell"
          },
          {
            "type": "Github",
            "url": "https://github.com/maxcell"
          }
        ]
      }
    },
    {
      "id": "azure",
      "title": "Running Python Web Apps…. on Azure?",
      "description": "Python on Microsoft Azure? You’ve got to be kidding me right? Nobody does that!\n\nIn today’s world, that couldn’t be further from the truth. Along with it’s investments in open source, Microsoft is making Azure a great platform for running apps.. period. In this talk, you’ll be introduced to a few of the services available in Azure that you can leverage for building out your web applications today. You’ll see how easily you can get your web app running in the cloud, connected to a NoSQL database, and integrating with a host of other useful services.\n\nThere is quite a bit available for Python Developers in Azure. Join me to get a taste of what’s possible.",
      "time": "3:20pm- 4:10pm",
      "location": "Canvs",
      "track": "Web",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/head_shot-Cecil-Phillip-e1506536786517.png",
        "name": "Cecil Phillip",
        "title": "Cloud Developer Advocate",
        "companyName": "",
        "links": [
          {
            "type": "Twitter",
            "url": "https://twitter.com/cecilphillip"
          },
          {
            "type": "Web",
            "url": "http://cecilphillip.com/"
          },
          {
            "type": "Github",
            "url": "https://github.com/cecilphillip"
          }
        ]
      }
    },
    {
      "id": "scraping",
      "title": "Scraping Data from Websites",
      "description": "In this talk I am going to show you how to scrape data from websites using the module BeautifulSoup. This talk assumes you know some basic python syntax and data modeling tools. After this talk you should be able to parse the data on a website and store whatever you need.\n\n      There are different ways that we can scrape data from a website, throughout the process we will take care not to overburden the website and not scrape anything forbidden by the web server. We are going to use a public library for python called “Beautiful Soup”, this is a really good tool when we want to take some information from a site. With this we also are going to mention how can we store this data into a CSV and Json file.",
      "time": "3:20pm- 4:10pm",
      "location": "PowerDMS",
      "track": "Data",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/miguel-circle.png",
        "name": "Miguel Tannous",
        "title": "Freelancer",
        "companyName": "",
        "links": [
          {
            "type": "Instagram",
            "url": "https://www.instagram.com/reponic/"
          },
          {
            "type": "Linkedin",
            "url": "https://www.linkedin.com/in/miguel-tannous-638b0a125/"
          }
        ]
      }
    },
    {
      "id": "stand_out",
      "title": "Stand Out",
      "description": "If you can code your way out of a paper bag (or even if you can’t) and want to differentiate yourself in an organization, you can. Come and learn tips that can help you to Stand Out in your organization. These tips can help you successfully lead changes big or small, or simply improve your ability to get people to listen to your suggestions. All of these can help you to Stand Out in your organization.",
      "time": "3:30pm- 4:20pm",
      "location": "The Iron Yard",
      "track": "Speaker's Choice",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/IMG_1424-Doug-Faist-e1506536859426.jpg",
        "name": "Doug Faist",
        "title": "Director",
        "companyName": "",
        "links": [
          {
            "type": "Twitter",
            "url": "https://twitter.com/dmfaist"
          }
        ]
      }
    },
    {
      "id": "geospatial",
      "title": "Geospatial Data Fusion – Beyond Bare Earth",
      "description": "Point clouds make for compelling 3D imagery, but there’s real engineering information in there too! See what we are mining out of airborne laser scanning data to enhance the resilience of coastal communities. Dr. Stephen Medeiros, a lecturer in Civil Engineering at the University of Central Florida, describes his team’s work in Geospatial Data Fusion for coastal resilience. Dr. Medeiros uses airborne laser scanning data (aka lidar) to characterize surface roughness for use in computer models for hurricane storm surge. All of his students are required to learn and apply Python to their data science tasks such as ETL, machine learning, and statistical analysis of a variety of environmental data such as wind speeds, water levels, and 3D laser scanning point clouds. By describing the coastal floodplain in intricate detail, Dr. Medeiros and his students study how the roughness of the landscape influence hurricane winds and storm surge behavior. This work is carried out on the STOKES HPC at the Advanced Research Computing Center in UCF’s Institute for Simulation and Training.",
      "time": "4:30pm- 5:20pm",
      "location": "PowerDMS",
      "track": "Data",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/stephen-circle.png",
        "name": "Stephen Medeiros",
        "title": "Lecturer",
        "companyName": "",
        "links": [
          {
            "type": "Twitter",
            "url": "https://twitter.com/dvigneshwer"
          },
        ]
      }
    },
    {
      "id": "django",
      "title": "Using Django with modern SPA Frameworks",
      "description": "Traditional web frameworks are over. Done. Right? Wrong! In this talk I will show you how I combined an excellent Single Page Application JavaScript framework (Vue.js) with Django and the amazing Django Rest Framework to get the best possible results, after evaluating other languages and frameworks.",
      "time": "4:30pm- 5:20pm",
      "location": "Canvs",
      "track": "Web",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/bo-circle.png",
        "name": "Bo Milanovich",
        "title": "Owner at Bogmil",
        "companyName": "Bogmil",
        "links": [
          {
            "type": "Twitter",
            "url": "http://www.twitter.com/pythonbo"
          },
          {
            "type": "Web",
            "url": "http://bomilanovich.com/"
          },
          {
            "type": "Pluralsight",
            "url": "https://app.pluralsight.com/profile/author/bo-milanovich"
          }
        ]
      }
    },
    {
      "id": "carpenter",
      "title": "A Carpenter’s Approach to Teaching Python",
      "description": "Using evidence from Data and Software Carpentry’s training impact surveys, this presentation explores training as a way to onboard individuals to use Python. Attendees will walk away with a perspective on training approaches and a feeling of empowerment to build a diverse Python community through training. The only prerequisite knowledge you need is your own desire to achieve equity in the Python community.",
      "time": "4:30pm- 5:20pm",
      "location": "The Iron Yard",
      "track": "Speaker's Choice",
      "speaker": {
        "headshot": "http://flpy.org/wp-content/uploads/2017/09/kari-circle.png",
        "name": "Kari L. Jordan",
        "title": "Deputy Director of Assessment",
        "companyName": "Data Carpentry",
        "links": [
          {
            "type": "Twitter",
            "url": "https://twitter.com/drkariljordan"
          },
          {
            "type": "Github",
            "url": "https://github.com/kariljordan"
          }
        ]
      }
    }
  ],
  "agenda": [
    {
      "title": "Check in & breakfast",
      "time": "8:00am",
      "location": "Canvs Kitchen"
    },
    {
      "title": "Keynote",
      "time": "9:00am",
      "location": "Location TBD"
    },
    {
      "title": "Talks Begin",
      "time": "10:00am",
      "location": ""
    },
    {
      "title": "Lunch",
      "time": "12:00pm",
      "location": "Location TBD"
    },
    {
      "title": "Talks Resume",
      "time": "1:30pm",
      "location": ""
    },
    {
      "title": "Break",
      "time": "3:00pm",
      "location": ""
    },
    {
      "title": "Talks Resume",
      "time": "3:15pm",
      "location": ""
    },
    {
      "title": "Final Remarks",
      "time": "4:45pm",
      "location": "Location TBD"
    },
    {
      "title": "Bar Slither",
      "time": "5:00pm",
      "location": "Location TBD"
    }
  ]
}
